# Python 3.5.2

# 算术运算符
# 比较运算符
# 赋值运算符
# 逻辑运算符
# 位运算符
# 成员运算符
# 身份运算符
# 运算符优先级

# Python算术运算符
# **	幂 - 返回x的y次幂
print( 5**3 )

# Python比较运算符
# ==	等于 - 比较对象是否相等	(a == b) 返回 False。
# !=	不等于 - 比较两个对象是否不相等	(a != b) 返回 True。
print( 5==6 )

# Python赋值运算符
# +=	加法赋值运算符	c += a 等效于 c = c + a
# -=	减法赋值运算符	c -= a 等效于 c = c - a
# *=	乘法赋值运算符	c *= a 等效于 c = c * a
# /=	除法赋值运算符	c /= a 等效于 c = c / a
# %=	取模赋值运算符	c %= a 等效于 c = c % a
# **=	幂赋值运算符	c **= a 等效于 c = c ** a
a = 8
c = 5
c += a   # 等效于 c = c + a
print( c )


# Python位运算符
# 按位运算符是把数字看作二进制来进行计算的
a = 60            # 60 = 0011 1100
b = 13            # 13 = 0000 1101
c = 0
c = a & b         # 12 = 0000 1100

# Python成员运算符 in 和 not in
a = [1, 2, '你好']
b = (1, 2, '你好')
c = {1:'a', 2:'b', '你好':'c'}
print( 1 in a, 1 in b, '你好' in c)


# Python身份运算符
# 注：id() 函数用于获取对象的内存地址。
# 身份运算符可以比较两个对象的存储单元
a = 20
b = 20
print( id(a) )
print( id(b) )




























